examples/homuPorousInterFoam/dambreakCrushedStone/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       21151;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       21271;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       21391;
    }
    porosityWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          58;
        startFace       21451;
    }
    atmosphere
    {
        type            patch;
        nFaces          60;
        startFace       21509;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          21360;
        startFace       21569;
    }
)

// ************************************************************************* //
